Repository: dkicekeeper/AIFinanceManager
Catalog: AIFinanceManager/AIFinanceManager/*.lproj/Localizable.strings
Languages: ru

# navigation.home
source: Home
ru: Главная

# navigation.history
source: History
ru: История

# navigation.categories
source: Categories
ru: Категории

# navigation.settings
source: Settings
ru: Настройки

# navigation.accounts
source: Accounts
ru: Счета

# navigation.subscriptions
source: Subscriptions
ru: Подписки

# navigation.categoryFilter
source: Filter by Categories
ru: Фильтр по категориям

# navigation.logoSearch
source: Search Logo
ru: Поиск логотипа

# navigation.entityMapping
source: Entity Mapping
ru: Сопоставление сущностей

# navigation.csvPreview
source: CSV Preview
ru: Превью CSV

# navigation.transactionPreview
source: Transaction Preview
ru: Предпросмотр транзакций

# transactionPreview.found
source: Found: %d transactions
ru: Найдено: %d транзакций

# transactionPreview.selectHint
source: Select transactions to import
ru: Выберите транзакции для добавления

# transactionPreview.selectAll
source: Select All
ru: Выбрать все

# transactionPreview.deselectAll
source: Deselect All
ru: Снять выбор

# transactionPreview.addSelected
source: Add Selected (%d)
ru: Добавить выбранные (%d)

# transactionPreview.noAccount
source: No Account
ru: Без счета

# transactionPreview.account
source: Account
ru: Счет

# navigation.statementText
source: Statement Text
ru: Текст выписки

# navigation.voiceInput
source: Voice Input
ru: Голосовой ввод

# navigation.subcategorySearch
source: Search Subcategories
ru: Поиск подкатегорий

# navigation.selectDate
source: Select Date
ru: Выберите дату

# navigation.selectIcon
source: Select Icon
ru: Выберите иконку

# navigation.selectLogo
source: Select Logo
ru: Выбрать логотип

# navigation.importResult
source: Import Result
ru: Результат импорта

# timeFilter.title
source: Time Filter
ru: Фильтр по времени

# timeFilter.presets
source: Presets
ru: Пресеты

# timeFilter.customPeriod
source: Custom Period
ru: Пользовательский период

# timeFilter.from
source: From
ru: С

# timeFilter.to
source: To
ru: По

# timeFilter.today
source: Today
ru: Сегодня

# timeFilter.yesterday
source: Yesterday
ru: Вчера

# timeFilter.thisWeek
source: This Week
ru: Эта неделя

# timeFilter.last30Days
source: Last 30 Days
ru: Последние 30 дней

# timeFilter.thisMonth
source: This Month
ru: Этот месяц

# timeFilter.lastMonth
source: Last Month
ru: Прошлый месяц

# timeFilter.thisYear
source: This Year
ru: Этот год

# timeFilter.lastYear
source: Last Year
ru: Прошлый год

# timeFilter.allTime
source: All Time
ru: Всё время

# timeFilter.custom
source: Custom Period
ru: Пользовательский период

# button.save
source: Save
ru: Сохранить

# button.cancel
source: Cancel
ru: Отмена

# button.delete
source: Delete
ru: Удалить

# button.close
source: Close
ru: Закрыть

# button.import
source: Import
ru: Импорт

# button.export
source: Export
ru: Экспорт

# button.copy
source: Copy
ru: Копировать

# button.add
source: Add
ru: Добавить

# button.edit
source: Edit
ru: Редактировать

# button.done
source: Done
ru: Готово

# button.continue
source: Continue
ru: Продолжить

# button.ok
source: OK
ru: ОК

# button.retry
source: Retry
ru: Повторить

# button.change
source: Change
ru: Изменить

# button.select
source: Select
ru: Выбрать

# button.apply
source: Apply
ru: Применить

# emptyState.noTransactions
source: No transactions
ru: Нет операций

# emptyState.noAccounts
source: No accounts
ru: Нет счетов

# emptyState.noCategories
source: No categories
ru: Нет категорий

# emptyState.noSubcategories
source: No subcategories
ru: Нет подкатегорий

# emptyState.noData
source: No data available
ru: Нет данных

# emptyState.searchNoResults
source: Nothing found
ru: Ничего не найдено

# emptyState.startTracking
source: Start adding transactions to track your finances
ru: Начните добавлять операции, чтобы отслеживать ваши финансы

# emptyState.tryDifferentSearch
source: Try changing your search query
ru: Попробуйте изменить поисковый запрос

# emptyState.tryDifferentFilters
source: Try changing filters or add a new transaction
ru: Попробуйте изменить фильтры или добавьте новую операцию

# settings.title
source: Settings
ru: Настройки

# settings.general
source: General Settings
ru: Общие настройки

# settings.baseCurrency
source: Base Currency
ru: Базовая валюта

# settings.wallpaper
source: Home Wallpaper
ru: Обои на главной

# settings.dataManagement
source: Data Management
ru: Управление данными

# settings.categories
source: Categories
ru: Категории

# settings.subcategories
source: Subcategories
ru: Подкатегории

# settings.accounts
source: Accounts
ru: Счета

# settings.exportImport
source: Export & Import
ru: Экспорт и импорт

# settings.exportData
source: Export Data
ru: Экспорт данных

# settings.importData
source: Import Data
ru: Импорт данных

# settings.dangerZone
source: Danger Zone
ru: Опасные действия

# settings.resetData
source: Full Data Reset
ru: Полный сброс данных

# alert.deleteAllData.title
source: Delete all data?
ru: Удалить все данные?

# alert.deleteAllData.message
source: All transactions, accounts, and categories will be permanently deleted.
ru: Все операции, счета и категории будут удалены без возможности восстановления.

# alert.deleteAllData.confirm
source: Delete
ru: Удалить

# alert.deleteAllData.cancel
source: Cancel
ru: Отмена

# alert.textCopied.title
source: Text copied
ru: Текст скопирован

# alert.textCopied.message
source: Recognized text has been copied to clipboard.
ru: Распознанный текст скопирован в буфер обмена.

# alert.parseError.title
source: Parse Error
ru: Ошибка парсинга

# alert.importError.title
source: Import Error
ru: Ошибка импорта

# alert.errorTitle
source: Error
ru: Ошибка

# progress.loadingData
source: Loading data...
ru: Загрузка данных...

# progress.processingPDF
source: Processing PDF...
ru: Обработка PDF...

# progress.recognizingText
source: Recognizing text: page %d of %d
ru: Распознавание текста: страница %d из %d

# progress.page
source: Page %d of %d
ru: Страница %d из %d

# progress.parsingStatement
source: Parsing statement...
ru: Парсинг выписки...

# error.loadTextFailed
source: Failed to load text
ru: Ошибка загрузки текста

# error.tryAgain
source: Try again
ru: Попробуйте еще раз

# error.noTransactionsFound
source: No transactions found in recognized text. Make sure the text contains a transaction table.
ru: Не удалось найти транзакции в распознанном тексте. Убедитесь, что текст содержит таблицу транзакций выписки.

# error.noTransactionsStructured
source: No transactions found in structured data. The statement format may differ from expected.
ru: Не удалось найти транзакции в структурированных данных. Возможно, формат выписки отличается от ожидаемого.

# error.pdfExtraction
source: Failed to extract text from PDF. The document may be corrupted or empty.
ru: Не удалось извлечь текст из PDF. Возможно, документ поврежден или пуст.

# error.importFailed
source: Import failed
ru: Ошибка импорта

# error.coredata.migrationFailed
source: Data migration failed. Please restart the app or contact support.
ru: Миграция данных не удалась. Пожалуйста, перезапустите приложение или обратитесь в поддержку.

# error.coredata.initializationFailed
source: Failed to initialize local storage. The app will work in limited mode.
ru: Не удалось инициализировать локальное хранилище. Приложение будет работать в ограниченном режиме.

# error.pdfRecognitionFailed
source: Recognition error: %@
ru: Ошибка при распознавании: %@

# accessibility.accountCard.label
source: %@ balance %@
ru: %@ баланс %@

# accessibility.accountCard.hint
source: Tap to view account details
ru: Нажмите для просмотра деталей счёта

# account.transfer
source: Transfer
ru: Перевод

# account.topUp
source: Top Up
ru: Пополнение

# account.withdrawal
source: Withdrawal
ru: Снятие

# analytics.history
source: History
ru: История

# analytics.planned
source: Planned
ru: В планах

# transaction.account
source: Account
ru: Счёт

# transaction.amount
source: Amount
ru: Сумма

# transaction.description
source: Description
ru: Описание

# transaction.date
source: Date
ru: Дата

# transaction.recurring
source: Recurring
ru: Повторяющаяся

# transaction.frequency
source: Frequency
ru: Частота

# transaction.category
source: Category
ru: Категория

# transaction.subcategories
source: Subcategories
ru: Подкатегории

# transaction.currency
source: Currency
ru: Валюта

# transaction.importTransactions
source: Import Transactions
ru: Импортировать транзакции

# transaction.addNew
source: Add Transaction
ru: Добавить операцию

# transaction.edit
source: Edit Transaction
ru: Редактировать операцию

# transaction.new
source: New Transaction
ru: Новая операция

# search.placeholder
source: Search by amount, category, or description
ru: Поиск по сумме, категории или описанию

source: Search subcategories
ru: Поиск подкатегорий

# modal.recognizedText.title
source: Recognized Text
ru: Распознанный текст

# modal.recognizedText.message
source: Text has been successfully recognized. You can import transactions or copy the text.
ru: Текст успешно распознан. Вы можете импортировать транзакции или скопировать текст.

# modal.newAccount
source: New Account
ru: Новый счёт

# modal.editAccount
source: Edit Account
ru: Редактировать счёт

# modal.newCategory
source: New Category
ru: Новая категория

# modal.editCategory
source: Edit Category
ru: Редактировать

# modal.newSubcategory
source: New Subcategory
ru: Новая подкатегория

# modal.editSubcategory
source: Edit Subcategory
ru: Редактировать подкатегорию

# common.name
source: Name
ru: Название

# common.balance
source: Balance
ru: Баланс

# common.type
source: Type
ru: Тип

# common.icon
source: Icon
ru: Иконка

# common.color
source: Color
ru: Цвет

# common.logo
source: Logo
ru: Логотип

# common.all
source: All
ru: Все

# common.selected
source: Selected
ru: Выбрано

# common.none
source: None
ru: Нет

# common.uncategorized
source: Uncategorized
ru: Без категории

# common.unknown
source: Unknown
ru: Неизвестно

# common.cancel
source: Cancel
ru: Отмена

# common.select
source: Select
ru: Выбрать

# common.selectAccount
source: Select Account
ru: Выбрать счёт

# common.selectCategory
source: Select Category
ru: Выбрать категорию

# common.selectSubcategory
source: Select Subcategory
ru: Выбрать подкатегорию

# common.selectColor
source: Select Color
ru: Выбрать цвет

# common.filterBy
source: Filter by
ru: Фильтр

# common.frequency
source: Frequency
ru: Частота

# common.startDate
source: Start Date
ru: Дата начала

# date.today
source: Today
ru: Сегодня

# date.yesterday
source: Yesterday
ru: Вчера

# date.tomorrow
source: Tomorrow
ru: Завтра

# date.selectDate
source: Date
ru: Дата

# date.choose
source: Choose Date
ru: Выберите дату

# transactionType.income
source: Income
ru: Доход

# transactionType.expense
source: Expense
ru: Расход

# transactionType.transfer
source: Transfer
ru: Перевод

# transaction.stopRecurring.title
source: Stop Recurring?
ru: Прекратить повторение?

# transaction.stopRecurring.message
source: This will stop the recurring transaction. All future transactions will be deleted.
ru: Это прекратит повторение операции. Все будущие транзакции будут удалены.

# transaction.stopRecurring.confirm
source: Stop Recurring
ru: Прекратить повторение

# transaction.stopRecurring.cancel
source: Cancel
ru: Отмена

# accessibility.deleteTransaction
source: Delete transaction
ru: Удалить транзакцию

# accessibility.stopRecurring
source: Stop recurring transaction
ru: Прекратить повторение транзакции

# accessibility.swipeForOptions
source: Swipe left for options
ru: Смахните влево для опций

# accounts.title
source: Accounts
ru: Счета

# account.interestToday
source: Interest today: %@
ru: Проценты на сегодня: %@

# account.nextPosting
source: Next posting: %@
ru: Начисление: %@

# account.selectLogo
source: Select Logo
ru: Выбрать логотип

# account.popularBanks
source: Popular Banks
ru: Популярные банки

# account.otherBanks
source: Other Banks
ru: Другие банки

# account.newAccount
source: New Account
ru: Новый счёт

# account.newDeposit
source: New Deposit
ru: Новый депозит

# account.namePlaceholder
source: Account name
ru: Название счёта

# account.deleteTitle
source: Delete Account
ru: Удалить счет

# account.deleteMessage
source: What would you like to do with transactions from '%@'?
ru: Что сделать с транзакциями счета '%@'?

# account.deleteOnlyAccount
source: Delete Only Account
ru: Удалить только счет

# account.deleteAccountAndTransactions
source: Delete Account and Transactions
ru: Удалить счет и транзакции

# common.currency
source: Currency
ru: Валюта

# common.error
source: Error
ru: Ошибка

source: Deposit not found
ru: Депозит не найден

# deposit.title
source: Deposit
ru: Депозит

# deposit.edit
source: Edit
ru: Редактировать

# deposit.changeRate
source: Change Rate
ru: Изменить ставку

# deposit.delete
source: Delete Deposit
ru: Удалить депозит

# deposit.deleteTitle
source: Delete deposit?
ru: Удалить депозит?

# deposit.deleteMessage
source: All deposit data and related transactions will be deleted.
ru: Все данные депозита и связанные транзакции будут удалены.

# deposit.balance
source: Balance
ru: Баланс

# deposit.interestToday
source: Interest today
ru: Проценты на сегодня

# deposit.rate
source: Rate
ru: Ставка

# deposit.rateAnnual
source: % per annum
ru: % годовых

# deposit.capitalization
source: Capitalization
ru: Капитализация

# deposit.capitalizationEnabled
source: Enabled
ru: Включена

# deposit.capitalizationDisabled
source: Disabled
ru: Выключена

# deposit.postingDay
source: Posting Day
ru: День начисления

# deposit.nextPosting
source: Next Posting
ru: Следующее начисление

# deposit.topUp
source: Top Up
ru: Пополнить

# deposit.transferToAccount
source: Transfer to Account
ru: Перевести на счет

# deposit.topUpTitle
source: Top Up Deposit
ru: Пополнить депозит

# deposit.transferFromTitle
source: Transfer from Deposit
ru: Перевести с депозита

# deposit.sourceAccount
source: Source Account
ru: Счет источника

# deposit.targetAccount
source: Target Account
ru: Счет получателя

# deposit.noOtherAccounts
source: No other accounts for transfer
ru: Нет других счетов для перевода

# deposit.amount
source: Amount
ru: Сумма

# deposit.description
source: Description
ru: Описание

# deposit.descriptionOptional
source: Description (optional)
ru: Описание (необязательно)

# deposit.date
source: Date
ru: Дата

# deposit.topUpDescription
source: Deposit top-up
ru: Пополнение депозита

# deposit.transferFromDescription
source: Transfer from deposit
ru: Перевод с депозита

# deposit.newRate
source: New Interest Rate
ru: Новая процентная ставка

# deposit.effectiveDate
source: Effective Date
ru: Дата вступления в силу

# deposit.note
source: Note (optional)
ru: Примечание (необязательно)

# deposit.changeRateTitle
source: Change Rate
ru: Изменить ставку

source: Deposit Name
ru: Название депозита

# deposit.namePlaceholder
source: Name
ru: Название

# deposit.bank
source: Bank
ru: Банк

# deposit.bankName
source: Bank Name
ru: Название банка

# deposit.bankNamePlaceholder
source: Bank name
ru: Название банка

# deposit.selectLogo
source: Select Logo
ru: Выбрать логотип

# deposit.initialAmount
source: Initial Amount
ru: Начальная сумма

# deposit.interestRate
source: Interest Rate
ru: Процентная ставка

# deposit.postingDayTitle
source: Interest Posting Day
ru: День начисления процентов

# deposit.dayOfMonth
source: Day of Month
ru: День месяца

# deposit.postingDayHint
source: If the month has fewer days, posting will occur on the last day of the month
ru: Если в месяце меньше дней, начисление произойдет в последний день месяца

# deposit.capitalizationTitle
source: Capitalization
ru: Капитализация

# deposit.enableCapitalization
source: Enable Capitalization
ru: Включить капитализацию

# deposit.capitalizationHint
source: When capitalization is enabled, interest is added to the principal amount each month
ru: При включенной капитализации проценты добавляются к основной сумме каждый месяц

# deposit.new
source: New Deposit
ru: Новый депозит

# deposit.editTitle
source: Edit Deposit
ru: Редактировать депозит

# categories.expenseCategories
source: Expense Categories
ru: Категории расходов

# categories.incomeCategories
source: Income Categories
ru: Категории доходов

# category.uncategorized
source: Uncategorized
ru: Без категории

# category.deleteTitle
source: Delete category?
ru: Удалить категорию?

# category.deleteOnlyCategory
source: Delete category only
ru: Удалить только категорию

# category.deleteCategoryAndTransactions
source: Delete category and transactions
ru: Удалить категорию и операции

# category.deleteMessage
source: Choose what to do with transactions in category "%@".
ru: Выберите, что делать с операциями категории "%@".

# category.namePlaceholder
source: Category name
ru: Название категории

# category.tapToSelect
source: Tap to select
ru: Нажмите для выбора

# category.subcategories
source: Subcategories
ru: Подкатегории

# category.addSubcategory
source: Add subcategory
ru: Добавить подкатегорию

# subcategory.new
source: New Subcategory
ru: Новая подкатегория

# subcategory.namePlaceholder
source: Subcategory name
ru: Название подкатегории

# iconPicker.title
source: Select Image
ru: Выбрать изображение

# iconPicker.iconsTab
source: Icons
ru: Иконки

# iconPicker.logosTab
source: Logos
ru: Логотипы

# iconPicker.frequentlyUsed
source: Frequently Used
ru: Часто используемые

# iconPicker.foodAndDrinks
source: Food & Drinks
ru: Еда и напитки

# iconPicker.transport
source: Transport
ru: Транспорт

# iconPicker.shopping
source: Shopping
ru: Покупки

# iconPicker.entertainment
source: Entertainment
ru: Развлечения

# iconPicker.health
source: Health
ru: Здоровье

# iconPicker.homeAndUtilities
source: Home & Utilities
ru: Дом и коммунальные

# iconPicker.moneyAndFinance
source: Money & Finance
ru: Деньги и финансы

# iconPicker.banks
source: Banks
ru: Банки

# iconPicker.streaming
source: Streaming & Entertainment
ru: Стриминг и развлечения

# iconPicker.productivity
source: Productivity & Cloud
ru: Продуктивность и облако

# iconPicker.social
source: Social & Communication
ru: Социальные и общение

# iconPicker.fitness
source: Fitness & Health
ru: Фитнес и здоровье

# iconPicker.gaming
source: Gaming
ru: Игры

# iconPicker.devTools
source: Developer Tools & AI
ru: Dev Tools и AI

# iconPicker.services
source: Services
ru: Сервисы

# iconPicker.popularBanks
source: Popular Banks
ru: Популярные банки

# iconPicker.otherBanks
source: Other Banks
ru: Другие банки

# iconPicker.searchOnline
source: Search brand logo...
ru: Поиск логотипа бренда...

# iconPicker.noLogo
source: No Logo
ru: Без логотипа

# iconPicker.searching
source: Searching...
ru: Поиск...

# iconPicker.searchResults
source: Search Results
ru: Результаты поиска

# categoryFilter.allCategories
source: All Categories
ru: Все категории

# categoryFilter.noExpenseCategories
source: No expense categories
ru: Нет категорий расходов

# categoryFilter.noIncomeCategories
source: No income categories
ru: Нет категорий доходов

# csv.emptyCell
source: Empty
ru: Пусто

# accessibility.voiceInput
source: Voice input
ru: Голосовой ввод

# accessibility.voiceInputHint
source: Record a transaction using voice
ru: Записать транзакцию голосом

# accessibility.importStatement
source: Import bank statement
ru: Импорт выписки

# accessibility.importStatementHint
source: Import transactions from PDF or CSV file
ru: Импортировать транзакции из PDF или CSV файла

# accessibility.calendar
source: Calendar
ru: Календарь

# accessibility.calendarHint
source: Select date range for filtering transactions
ru: Выбрать диапазон дат для фильтрации транзакций

# accessibility.settings
source: Settings
ru: Настройки

# accessibility.settingsHint
source: Open application settings
ru: Открыть настройки приложения

# quickAdd.account
source: Account
ru: Счёт

# quickAdd.amount
source: Amount
ru: Сумма

# quickAdd.description
source: Description
ru: Описание

# quickAdd.descriptionPlaceholder
source: Description (optional)
ru: Описание (необязательно)

# quickAdd.recurring
source: Recurring Transaction
ru: Повторяющаяся операция

# quickAdd.makeRecurring
source: Recurring
ru: Повторение

# quickAdd.frequency
source: Frequency
ru: Частота

# quickAdd.subcategories
source: Subcategories
ru: Подкатегории

# quickAdd.searchSubcategories
source: Search Subcategories
ru: Поиск подкатегорий

# quickAdd.searchAndAddSubcategories
source: Search and Add Subcategories
ru: Поиск и добавление подкатегорий

# quickAdd.selectDate
source: Select Date
ru: Выберите дату

# quickAdd.done
source: Done
ru: Готово

# quickAdd.cancel
source: Cancel
ru: Отмена

# error.validation.enterAmount
source: Enter a valid amount
ru: Введите корректную сумму

# error.validation.amountGreaterThanZero
source: Amount must be greater than zero
ru: Сумма должна быть больше нуля

# error.validation.selectAccount
source: Select an account
ru: Выберите счёт

# error.validation.accountNotFound
source: Account not found
ru: Счёт не найден

# voice.title
source: Voice Input
ru: Голосовой ввод

# voice.speak
source: Speak...
ru: Говорите...

# voice.recording
source: Recording...
ru: Идет запись...

# voice.error
source: Error
ru: Ошибка

# voice.errorMessage
source: Failed to start recording
ru: Не удалось начать запись

# voice.emptyText
source: No text was recognized. Please try again.
ru: Текст не распознан. Попробуйте еще раз.

# voice.vadToggle
source: Auto-stop on silence
ru: Авто-остановка при тишине

# voice.vadDescription
source: Recording will stop automatically after 2.5 seconds of silence
ru: Запись остановится автоматически после 2.5 секунд тишины

# voiceConfirmation.title
source: Review Operation
ru: Проверьте операцию

# voiceConfirmation.type
source: Operation Type
ru: Тип операции

# voiceConfirmation.noAccounts
source: No available accounts
ru: Нет доступных счетов

# voiceConfirmation.selectCategory
source: Select category
ru: Выберите категорию

# voiceConfirmation.warning.accountNotFound
source: Account not found — selected by default
ru: Счёт не найден — выбран по умолчанию

# voiceConfirmation.warning.accountNotRecognized
source: Account not recognized — selected by default
ru: Счёт не распознан — выбран по умолчанию

# voiceConfirmation.warning.enterAmount
source: Enter amount
ru: Введите сумму

# voiceConfirmation.warning.enterValidAmount
source: Enter a valid amount
ru: Введите корректную сумму

# voiceConfirmation.warning.selectAccount
source: Select an account
ru: Выберите счёт

# voiceConfirmation.warning.accountNotSelected
source: Account not selected — using default
ru: Счёт не выбран — использован по умолчанию

# voiceConfirmation.warning.categoryNotRecognized
source: Category not recognized — selected by default
ru: Категория не распознана — выбрана по умолчанию

# voiceConfirmation.warning.selectCategory
source: Select category
ru: Выберите категорию

# voiceConfirmation.warning.categoryNotSelected
source: Category not selected — using default
ru: Категория не выбрана — использована по умолчанию

# voiceConfirmation.warning.categoryNotFound
source: Failed to find category
ru: Не удалось найти категорию

# subscriptions.title
source: Subscriptions
ru: Подписки

# subscriptions.empty
source: No Subscriptions
ru: Нет подписок

# subscriptions.emptyDescription
source: Add a subscription to track recurring payments
ru: Добавьте подписку, чтобы отслеживать регулярные платежи

# subscriptions.addSubscription
source: Add Subscription
ru: Добавить подписку

# subscriptions.deleteConfirmTitle
source: Delete subscription?
ru: Удалить подписку?

# subscriptions.deleteConfirmMessage
source: All subscription data and related transactions will be deleted.
ru: Все данные подписки и связанные транзакции будут удалены.

# subscriptions.delete
source: Delete
ru: Удалить
