Repository: dkicekeeper/AIFinanceManager
Catalog: AIFinanceManager/AIFinanceManager/*.lproj/Localizable.strings
Languages: ru

# subscriptions.deleteOnlySubscription
source: Delete Only Subscription
ru: Удалить только подписку

# subscriptions.deleteSubscriptionAndTransactions
source: Delete Subscription and Transactions
ru: Удалить подписку и транзакции

# subscriptions.edit
source: Edit
ru: Редактировать

# subscriptions.pause
source: Pause
ru: Приостановить

# subscriptions.resume
source: Resume
ru: Возобновить

# subscriptions.transactionHistory
source: Transaction History
ru: История транзакций

# subscriptions.category
source: Category
ru: Категория

# subscriptions.frequency
source: Frequency
ru: Частота

# subscriptions.nextCharge
source: Next Charge
ru: Следующее списание

# subscriptions.account
source: Account
ru: Счёт

# subscriptions.status
source: Status
ru: Статус

# subscriptions.status.active
source: Active
ru: Активна

# subscriptions.status.paused
source: Paused
ru: Приостановлена

# subscriptions.status.archived
source: Archived
ru: В архиве

# subscriptions.status.unknown
source: Unknown
ru: Неизвестно

# notification.permission.title
source: Enable Reminders?
ru: Включить напоминания?

# notification.permission.description
source: Get notified about upcoming subscription charges so you never miss an important payment
ru: Получайте уведомления о предстоящих списаниях по подпискам, чтобы не пропустить важные платежи

# notification.permission.allow
source: Allow Notifications
ru: Разрешить уведомления

# notification.permission.skip
source: Not Now
ru: Не сейчас

# emptyState.noActiveSubscriptions
source: No active subscriptions
ru: Нет активных подписок

# subscriptions.activeCount
source: %lld active
ru: Активных %lld

# subscriptions.nextChargeOn
source: Next charge: %@
ru: Следующее: %@

# frequency.daily
source: Daily
ru: Ежедневно

# frequency.weekly
source: Weekly
ru: Еженедельно

# frequency.monthly
source: Monthly
ru: Ежемесячно

# frequency.yearly
source: Yearly
ru: Ежегодно

# subscription.basicInfo
source: Basic Information
ru: Основная информация

# subscription.namePlaceholder
source: Subscription Name
ru: Название подписки

# subscription.reminders
source: Reminders
ru: Напоминания

# subscription.newTitle
source: New Subscription
ru: Новая подписка

# subscription.editTitle
source: Edit Subscription
ru: Редактировать подписку

# reminder.dayBefore.one
source: 1 day before
ru: За 1 день

# reminder.daysBefore.3
source: 3 days before
ru: За 3 дня

# reminder.daysBefore.7
source: 7 days before
ru: За 7 дней

# reminder.daysBefore.30
source: 30 days before
ru: За 30 дней

# account.noAccountsAvailable
source: No accounts available
ru: Нет доступных счетов

# account.selectAccount
source: Select account
ru: Выберите счёт

# category.selectCategory
source: Select category
ru: Выберите категорию

# error.subscriptionNameRequired
source: Enter subscription name
ru: Введите название подписки

# error.invalidAmount
source: Enter valid amount
ru: Введите корректную сумму

# error.categoryRequired
source: Select category
ru: Выберите категорию

# error.accountRequired
source: Select payment account
ru: Выберите счёт оплаты

# error.accountNameRequired
source: Enter account name
ru: Введите название счёта

# error.categoryNameRequired
source: Enter category name
ru: Введите название категории

source: Budget Amount
ru: Сумма бюджета

# budget.period
source: Period
ru: Период

# budget.weekly
source: Weekly
ru: Еженедельно

# budget.monthly
source: Monthly
ru: Ежемесячно

source: Yearly
ru: Ежегодно

# budget_reset_day
source: Reset on day
ru: Сброс в день

# budget_reset_day_description
source: The day of the month when the budget resets (1-31)
ru: День месяца, когда бюджет обнуляется (1-31)

source: Budget Settings
ru: Настройки бюджета

source: Current Budget
ru: Текущий бюджет

source: Current Settings
ru: Текущие настройки

source: Remove Budget
ru: Удалить бюджет

source: Set Budget for
ru: Установить бюджет для

source: Save
ru: Сохранить

source: Cancel
ru: Отмена

# calendar.upcomingPayments
source: Upcoming Payments
ru: Ближайшие платежи

# calendar.month
source: Month
ru: Месяц

# calendar.halfYear
source: 6 Months
ru: Полгода

# calendar.year
source: Year
ru: Год

# calendar.noUpcomingPayments
source: No upcoming payments
ru: Нет ближайших платежей

# calendar.currentMonth
source: Current Month
ru: Текущий месяц

# transactionForm.amount
source: Amount
ru: Сумма

# transactionForm.description
source: Description
ru: Описание

# transactionForm.descriptionPlaceholder
source: Description (optional)
ru: Описание (необязательно)

# transactionForm.category
source: Category
ru: Категория

# transactionForm.selectCategory
source: Select category
ru: Выберите категорию

# transactionForm.noCategories
source: No available categories. Create categories first.
ru: Нет доступных категорий. Создайте категории сначала.

# transactionForm.transfer
source: Transfer
ru: Перевод

# transactionForm.topUp
source: Top Up
ru: Пополнение

# transactionForm.toAccount
source: To Account
ru: Счет получателя

# transactionForm.fromAccount
source: From Account
ru: Счет источника

# transactionForm.noAccountsForTransfer
source: No other accounts for transfer
ru: Нет других счетов для перевода

# transactionForm.enterPositiveAmount
source: Enter a positive amount
ru: Введите положительную сумму

# transactionForm.selectCategoryIncome
source: Select income category
ru: Выберите категорию дохода

# transactionForm.cannotTransferToSame
source: Cannot transfer to the same account
ru: Нельзя перевести средства на тот же счет

# transactionForm.accountNotFound
source: Account not found
ru: Счет не найден

# transactionForm.depositTopUp
source: Top Up Deposit
ru: Пополнение депозита

# transactionForm.depositWithdrawal
source: Withdraw from Deposit
ru: Перевод с депозита

# transactionForm.accountTopUp
source: Top Up Account
ru: Пополнение счета

# transactionForm.editTransaction
source: Edit Transaction
ru: Редактировать операцию

# transactionForm.recurring
source: Recurring
ru: Повторяющаяся

# transactionForm.makeRecurring
source: Make this recurring
ru: Сделать повторяющейся

# transactionForm.searchSubcategories
source: Search subcategories
ru: Поиск подкатегорий

# transactionForm.addSubcategory
source: Add subcategory
ru: Добавить подкатегорию

# transactionForm.createSubcategory
source: Create "%@"
ru: Создать "%@"

# transactionForm.searchAndAddSubcategories
source: Search and add subcategories
ru: Поиск и добавление подкатегорий

# transactionForm.searchOrCreateSubcategory
source: Find or create subcategory
ru: Найти или создать подкатегорию

# recurring.error.seriesNotFound
source: Recurring series not found
ru: Повторяющаяся транзакция не найдена

# recurring.error.invalidFrequency
source: Invalid frequency selected
ru: Выбрана неверная частота

# recurring.error.invalidAmount
source: Amount must be greater than zero
ru: Сумма должна быть больше нуля

# recurring.error.invalidStartDate
source: Invalid start date
ru: Неверная дата начала

# recurring.error.missingAccount
source: Please select an account
ru: Пожалуйста, выберите счёт

# recurring.validation.amountRequired
source: Amount is required
ru: Требуется указать сумму

# recurring.validation.descriptionRequired
source: Description is required
ru: Требуется указать описание

# category.other
source: Other
ru: Другое

# csvImport.error.missingRequiredColumn
source: Missing required column
ru: Отсутствует обязательная колонка

# csvImport.error.invalidDateFormat
source: Invalid date format in row %d: %@
ru: Неверный формат даты в строке %d: %@

# csvImport.error.invalidAmount
source: Invalid amount in row %d: %@
ru: Неверная сумма в строке %d: %@

# csvImport.error.invalidType
source: Invalid transaction type in row %d: %@
ru: Неверный тип операции в строке %d: %@

# csvImport.error.emptyValue
source: Empty value in row %d, column '%@'
ru: Пустое значение в строке %d, колонка '%@'

# csvImport.error.duplicateTransaction
source: Duplicate transaction in row %d
ru: Дубликат транзакции в строке %d

# csvImport.error.fileAccessDenied
source: File access denied
ru: Нет доступа к файлу

# csvImport.error.invalidEncoding
source: Invalid file encoding (UTF-8 required)
ru: Неверная кодировка файла (требуется UTF-8)

# csvImport.error.emptyFile
source: File is empty
ru: Файл пуст

# csvImport.error.noHeaders
source: No headers found in file
ru: В файле отсутствуют заголовки

# csvImport.error.invalidFormat
source: Invalid CSV format
ru: Неверный формат CSV

# csvImport.progress.parsing
source: Parsing CSV file...
ru: Парсинг CSV файла...

# csvImport.progress.validating
source: Validating rows...
ru: Валидация строк...

# csvImport.progress.importing
source: Importing transactions...
ru: Импорт транзакций...

# csvImport.progress.finalizing
source: Finalizing import...
ru: Завершение импорта...

# csvImport.result.imported
source: %d imported
ru: %d импортировано

# csvImport.result.skipped
source: %d skipped
ru: %d пропущено

# csvImport.result.duplicates
source: %d duplicates
ru: %d дубликатов

# csvImport.result.createdAccounts
source: %d accounts created
ru: %d счетов создано

# csvImport.result.createdCategories
source: %d categories created
ru: %d категорий создано

# csvImport.result.createdSubcategories
source: %d subcategories created
ru: %d подкатегорий создано

# csvImport.result.duration
source: Duration
ru: Время

# csvImport.result.speed
source: Speed
ru: Скорость

# csvImport.result.title
source: Import Complete
ru: Импорт завершён

# csvImport.button.cancel
source: Cancel Import
ru: Отменить импорт

# csvImport.button.retry
source: Retry
ru: Повторить

# csvImport.button.viewErrors
source: View Errors
ru: Посмотреть ошибки

# csvImport.preview.title
source: CSV Preview
ru: Предпросмотр CSV

# csvImport.preview.rows
source: Rows
ru: Строк

# csvImport.preview.columns
source: Columns
ru: Колонок

# csvImport.mapping.title
source: Column Mapping
ru: Маппинг колонок

# csvImport.mapping.required
source: Required Fields
ru: Обязательные поля

# csvImport.mapping.optional
source: Optional Fields
ru: Опциональные поля

# csvImport.mapping.date
source: Date
ru: Дата

# csvImport.mapping.type
source: Type
ru: Тип

# csvImport.mapping.amount
source: Amount
ru: Сумма

# csvImport.mapping.currency
source: Currency
ru: Валюта

# csvImport.mapping.account
source: Account
ru: Счёт

# csvImport.mapping.none
source: None
ru: Нет

# csvImport.entityMapping.title
source: Entity Mapping
ru: Маппинг сущностей

# csvImport.entityMapping.accounts
source: Accounts
ru: Счета

# csvImport.entityMapping.categories
source: Categories
ru: Категории

# csvImport.entityMapping.autoCreate
source: Will be created automatically
ru: Будет создано автоматически

# csvImport.preview.fileInfo
source: File Information
ru: Информация о файле

# csvImport.preview.headersTitle
source: Columns in File
ru: Колонки в файле

# csvImport.preview.dataPreview
source: Data Preview (first %d rows)
ru: Предпросмотр данных (первые %d строк)

# csvImport.preview.empty
source: (empty)
ru: (пусто)

# csvImport.mapping.category
source: Category
ru: Категория

# csvImport.mapping.targetAccount
source: Target Account
ru: Счёт получателя

# csvImport.mapping.targetCurrency
source: Target Currency
ru: Валюта получателя

# csvImport.mapping.targetAmount
source: Target Amount
ru: Сумма получателя

# csvImport.mapping.subcategories
source: Subcategories
ru: Подкатегории

# csvImport.mapping.note
source: Note
ru: Заметка

# csvImport.mapping.dateFormat
source: Date Format
ru: Формат даты

# csvImport.mapping.subcategoriesSeparator
source: Subcategory Separator
ru: Разделитель подкатегорий

# csvImport.mapping.separator.semicolon
source: (semicolon)
ru: (точка с запятой)

# csvImport.mapping.separator.comma
source: (comma)
ru: (запятая)

# csvImport.mapping.separator.pipe
source: (pipe)
ru: (вертикальная черта)

# csvImport.result.performance
source: Performance
ru: Производительность

# csvImport.result.successRate
source: Success Rate
ru: Успешность

# csvImport.result.errors
source: Errors
ru: Ошибки

# csvImport.result.moreErrors
source: ... and %d more errors
ru: ... и ещё %d ошибок

# error.settings.loadFailed
source: Failed to load settings: %@
ru: Не удалось загрузить настройки: %@

# error.settings.saveFailed
source: Failed to save settings: %@
ru: Не удалось сохранить настройки: %@

# error.settings.corruptedData
source: Settings data is corrupted
ru: Данные настроек повреждены

# error.settings.migrationFailed
source: Failed to migrate settings
ru: Не удалось мигрировать настройки

# error.settings.invalidCurrency
source: Invalid currency: %@
ru: Недопустимая валюта: %@

# error.settings.wallpaperNotFound
source: Wallpaper file not found: %@
ru: Файл обоев не найден: %@

# error.settings.wallpaperCorrupted
source: Wallpaper file is corrupted: %@
ru: Файл обоев поврежден: %@

# error.settings.invalidLanguage
source: Invalid language: %@
ru: Недопустимый язык: %@

# error.wallpaper.compressionFailed
source: Failed to compress wallpaper image
ru: Не удалось сжать изображение обоев

# error.wallpaper.fileTooLarge
source: Wallpaper file is too large (max 10 MB)
ru: Файл обоев слишком большой (макс 10 МБ)

# error.wallpaper.insufficientSpace
source: Insufficient disk space
ru: Недостаточно места на диске

# error.wallpaper.fileNotFound
source: Wallpaper file not found
ru: Файл обоев не найден

# error.wallpaper.corruptedFile
source: Wallpaper file is corrupted
ru: Файл обоев поврежден

# error.wallpaper.invalidFormat
source: Invalid image format
ru: Недопустимый формат изображения

# error.wallpaper.saveFailed
source: Failed to save wallpaper: %@
ru: Не удалось сохранить обои: %@

# error.wallpaper.loadFailed
source: Failed to load wallpaper: %@
ru: Не удалось загрузить обои: %@

# error.reset.failed
source: Failed to reset data: %@
ru: Не удалось сбросить данные: %@

# error.recalculation.failed
source: Failed to recalculate balances: %@
ru: Не удалось пересчитать балансы: %@

# error.reset.viewModelNotAvailable
source: Required view model not available: %@
ru: Требуемая ViewModel недоступна: %@

# error.export.noData
source: No data to export
ru: Нет данных для экспорта

# error.export.failed
source: Failed to export data: %@
ru: Не удалось экспортировать данные: %@

# error.export.fileWriteFailed
source: Failed to write export file: %@
ru: Не удалось записать файл экспорта: %@

# error.export.insufficientSpace
source: Insufficient disk space for export
ru: Недостаточно места на диске для экспорта

# alert.recalculateBalances.title
source: Recalculate Balances?
ru: Пересчитать балансы?

# alert.recalculateBalances.message
source: This will recalculate all account balances from scratch based on transactions. Use this if balances are displayed incorrectly.
ru: Это пересчитает балансы всех счетов с нуля на основе транзакций. Используйте это, если балансы отображаются неправильно.

# alert.recalculateBalances.confirm
source: Recalculate
ru: Пересчитать

# alert.selectWallpaper.title
source: Select Wallpaper
ru: Выбрать обои

# alert.removeWallpaper.title
source: Remove Wallpaper?
ru: Удалить обои?

# alert.removeWallpaper.message
source: This will remove the current wallpaper from the home screen
ru: Это удалит текущие обои с главного экрана

# alert.exportSuccess.title
source: Export Successful
ru: Экспорт завершен

# alert.exportSuccess.message
source: Data exported to %@
ru: Данные экспортированы в %@

# alert.importSuccess.title
source: Import Successful
ru: Импорт завершен

# alert.importSuccess.message
source: Imported %d transactions
ru: Импортировано транзакций: %d

# settings.recalculateBalances
source: Recalculate Account Balances
ru: Пересчитать балансы счетов

# settings.wallpaperHistory
source: Wallpaper History
ru: История обоев

# settings.recentCurrencies
source: Recent Currencies
ru: Недавние валюты

# settings.exportProgress
source: Exporting... %d%%
ru: Экспорт... %d%%

# settings.importProgress
source: Importing... %d%%
ru: Импорт... %d%%

# success.settings.currencyUpdated
source: Currency updated successfully
ru: Валюта успешно обновлена

# success.settings.wallpaperUpdated
source: Wallpaper updated successfully
ru: Обои успешно обновлены

# success.settings.wallpaperRemoved
source: Wallpaper removed successfully
ru: Обои успешно удалены

# success.export.completed
source: Data exported successfully
ru: Данные успешно экспортированы

# success.reset.completed
source: All data has been reset
ru: Все данные сброшены

# success.recalculation.completed
source: Balances recalculated successfully
ru: Балансы успешно пересчитаны

# error.import.coordinatorNotAvailable
source: Import coordinator not available
ru: Координатор импорта недоступен

# error.import.viewModelsNotAvailable
source: Required view models not available
ru: Требуемые ViewModels недоступны

# progress.importing
source: Importing...
ru: Импорт...

# error.transaction.invalidAmount
source: Invalid transaction amount
ru: Неверная сумма транзакции

# error.transaction.accountNotFound
source: Source account not found
ru: Счёт-источник не найден

# error.transaction.targetAccountNotFound
source: Target account not found
ru: Счёт-получатель не найден

# error.transaction.categoryNotFound
source: Category not found
ru: Категория не найдена

# error.transaction.notFound
source: Transaction not found
ru: Транзакция не найдена

# error.transaction.idMismatch
source: Transaction ID mismatch
ru: Несовпадение ID транзакции

# error.transaction.cannotRemoveRecurring
source: Cannot remove recurring series from transaction
ru: Невозможно удалить повторяющуюся серию из транзакции

# error.transaction.cannotDeleteDepositInterest
source: Cannot delete deposit interest transaction
ru: Невозможно удалить транзакцию начисления процентов

# error.transaction.persistenceFailed
source: Failed to save transaction
ru: Не удалось сохранить транзакцию

# iconStyle.shape.circle
source: Circle
ru: Круг

# iconStyle.shape.roundedSquare
source: Rounded Square
ru: Скругленный квадрат

# iconStyle.shape.square
source: Square
ru: Квадрат

# iconStyle.tint.monochrome
source: Monochrome
ru: Монохром

# iconStyle.tint.hierarchical
source: Hierarchical
ru: Иерархический

# iconStyle.tint.palette
source: Palette
ru: Палитра

# iconStyle.tint.original
source: Original Colors
ru: Оригинальные цвета

# iconStyle.preset.categoryIcon
source: Category Icon
ru: Иконка категории

# iconStyle.preset.bankLogo
source: Bank Logo
ru: Логотип банка

# iconStyle.preset.serviceLogo
source: Service Logo
ru: Логотип сервиса

# iconStyle.preset.placeholder
source: Placeholder
ru: Заглушка

# recurring.never
source: Never
ru: Никогда

# reminder.none
source: Never
ru: Никогда

# filter.allAccounts
source: All Accounts
ru: Все счета

# filter.allCategories
source: All Categories
ru: Все категории

# filter.categoriesCount
source: %d categories
ru: %d категорий

# input.titleHint
source: Tap to edit name
ru: Нажмите для редактирования

# input.balanceHint
source: Tap to edit balance
ru: Нажмите для редактирования суммы

# insights.title
source: Insights
ru: Аналитика

# insights.all
source: All
ru: Все

# insights.spending
source: Spending
ru: Расходы

# insights.income
source: Income
ru: Доходы

# insights.expenses
source: Expenses
ru: Расходы

# insights.budget
source: Budget
ru: Бюджет

# insights.recurring
source: Recurring
ru: Регулярные

# insights.cashFlow
source: Cash Flow
ru: Денежный поток

# insights.netFlow
source: Net Flow
ru: Чистый поток

# insights.ratio
source: Income/Expense Ratio
ru: Соотношение доходов/расходов

# insights.loading
source: Analyzing your finances...
ru: Анализируем ваши финансы...

# insights.emptyState.title
source: No insights yet
ru: Пока нет аналитики

# insights.emptyState.description
source: Add some transactions to see your financial insights
ru: Добавьте транзакции, чтобы увидеть финансовую аналитику

# insights.noInsightsForFilter
source: No insights for this category
ru: Нет данных для этой категории

# insights.topCategory
source: Top Spending Category
ru: Топ категория расходов

# insights.ofTotal
source: of total spending
ru: от общих расходов

# insights.spendingSpike
source: Unusual Spending Detected
ru: Обнаружены необычные траты

# insights.monthOverMonth
source: Monthly Spending Change
ru: Расходы за месяц

# insights.monthOverMonth.week
source: Weekly Spending
ru: Расходы за неделю

# insights.monthOverMonth.month
source: Monthly Spending Change
ru: Расходы за месяц

# insights.monthOverMonth.quarter
source: Quarterly Spending
ru: Расходы за квартал

# insights.monthOverMonth.year
source: Yearly Spending
ru: Расходы за год

# insights.avgDailySpending
source: Average Daily Spending
ru: Среднедневные расходы

# insights.days
source: days
ru: дней

# insights.incomeGrowth
source: Income Trend
ru: Тренд доходов

# insights.incomeVsExpense
source: Income vs Expenses
ru: Доходы vs Расходы

# insights.vsPreviousPeriod
source: vs previous period
ru: к прошлому периоду

# insights.vsAverage
source: vs average
ru: к среднему

# insights.budgetOver
source: Over Budget
ru: Превышение бюджета

# insights.budgetUnder
source: Under Budget
ru: В рамках бюджета

# insights.projectedOverspend
source: Projected Overspend
ru: Прогноз перерасхода

# insights.categoriesOverBudget
source: %d categories over budget
ru: %d категорий с перерасходом

# insights.categoriesAtRisk
source: %d categories at risk
ru: %d категорий под угрозой

# insights.categoriesUnderBudget
source: %d categories on track
ru: %d категорий в норме

# insights.categoriesUnit
source: categories
ru: категорий

# insights.totalRecurring
source: Monthly Recurring Costs
ru: Ежемесячные регулярные расходы

# insights.totalRecurring.week
source: Weekly Recurring
ru: Регулярные за неделю

# insights.totalRecurring.month
source: Monthly Recurring Costs
ru: Ежемесячные регулярные

# insights.totalRecurring.quarter
source: Quarterly Recurring
ru: Регулярные за квартал

# insights.totalRecurring.year
source: Yearly Recurring
ru: Регулярные за год

# insights.activeRecurring
source: %d active recurring
ru: %d активных подписок

# insights.perMonth
source: per month
ru: в месяц

# insights.perWeek
source: per week
ru: в неделю

# insights.perQuarter
source: per quarter
ru: в квартал

# insights.perYear
source: per year
ru: в год

# insights.netCashFlow
source: Net Cash Flow
ru: Чистый денежный поток

# insights.bestMonth
source: Best Month
ru: Лучший месяц

# insights.bestPeriod.week
source: Best Week
ru: Лучшая неделя

# insights.bestPeriod.month
source: Best Month
ru: Лучший месяц

# insights.bestPeriod.quarter
source: Best Quarter
ru: Лучший квартал

# insights.bestPeriod.year
source: Best Year
ru: Лучший год

# insights.bestPeriod.allTime
source: Best Period
ru: Лучший период

# insights.worstMonth
source: Worst Month
ru: Худший месяц

# insights.worstPeriod.week
source: Worst Week
ru: Худшая неделя

# insights.worstPeriod.month
source: Worst Month
ru: Худший месяц

# insights.worstPeriod.quarter
source: Worst Quarter
ru: Худший квартал

# insights.worstPeriod.year
source: Worst Year
ru: Худший год

# insights.worstPeriod.allTime
source: Worst Period
ru: Худший период

# insights.projectedBalance
source: Projected Balance
ru: Прогноз баланса

# insights.in30Days
source: in 30 days
ru: через 30 дней

# insights.projected
source: projected change
ru: прогнозируемое изменение

# insights.currentBalance
source: Current balance
ru: Текущий баланс

# insights.cashFlowTrend
source: Cash Flow Trend
ru: Тренд денежных потоков

# insights.breakdown
source: Breakdown
ru: Детализация

# insights.monthlyBreakdown
source: Monthly Breakdown
ru: По месяцам

# insights.other
source: Other
ru: Другое

# insights.noSubcategory
source: No subcategory
ru: Без подкатегории

# insights.spendingTrend
source: Spending Trend
ru: Тренд расходов

# insights.subcategories
source: Subcategories
ru: Подкатегории
