Repository: dkicekeeper/AIFinanceManager
Catalog: AIFinanceManager/AIFinanceManager/*.lproj/Localizable.strings
Languages: ru

# insights.periodComparison
source: Period Comparison
ru: Сравнение периодов

# insights.daysLeft
source: %d days left
ru: %d дней осталось

# insights.granularity.week
source: By Weeks
ru: По неделям

# insights.granularity.month
source: By Months
ru: По месяцам

# insights.granularity.quarter
source: By Quarters
ru: По кварталам

# insights.granularity.year
source: By Years
ru: По годам

# insights.granularity.allTime
source: All Time
ru: Всё время

# insights.granularity.week.short
source: Week
ru: Нед

# insights.granularity.month.short
source: Month
ru: Мес

# insights.granularity.quarter.short
source: Quarter
ru: Кв

# insights.granularity.year.short
source: Year
ru: Год

# insights.granularity.allTime.short
source: All
ru: Всё

# insights.granularity.prev.week
source: vs prev. week
ru: к пред. неделе

# insights.granularity.prev.month
source: vs prev. month
ru: к пред. месяцу

# insights.granularity.prev.quarter
source: vs prev. quarter
ru: к пред. кварталу

# insights.granularity.prev.year
source: vs prev. year
ru: к пред. году

# insights.wealth
source: Capital
ru: Капитал

# insights.wealth.title
source: Accumulated Capital
ru: Накопленный капитал

# insights.wealth.subtitle
source: Total balance across all accounts
ru: Общий баланс всех счетов

# insights.wealth.accounts
source: Accounts
ru: Счета

# insights.wealthGrowth
source: Wealth Change
ru: Изменение капитала

# insights.savings
source: Savings
ru: Сбережения

# insights.savingsRate
source: Savings Rate
ru: Норма сбережений

# insights.emergencyFund
source: Emergency Fund
ru: Финансовая подушка

# insights.monthsCovered
source: %d months covered
ru: покрывает %d месяцев

# insights.months
source: months
ru: месяцев

# insights.savingsMomentum
source: Savings Momentum
ru: Динамика сбережений

# insights.vsPrevious3Months
source: vs previous 3 months
ru: к среднему за 3 месяца

# insights.categoryTrend
source: Spending Trend
ru: Тренд расходов

# insights.categoryTrend.risingMonths
source: Rising for %d months
ru: Растёт %d месяцев

# insights.subscriptionGrowth
source: Subscription Growth
ru: Рост подписок

# insights.vsThreeMonthsAgo
source: vs 3 months ago
ru: к 3 месяцам назад

# insights.forecasting
source: Forecast
ru: Прогноз

# insights.spendingForecast
source: Monthly Spending Forecast
ru: Прогноз расходов

# insights.balanceRunway
source: Balance Runway
ru: Запас баланса

# insights.balanceRunway.months
source: months of runway
ru: месяцев хватит

# insights.yearOverYear
source: Year-over-Year
ru: Год к году

# insights.incomeSeasonality
source: Income Seasonality
ru: Сезонность доходов

# insights.spendingVelocity
source: Spending Velocity
ru: Темп расходов

# insights.incomeSourceBreakdown
source: Income Sources
ru: Источники дохода

# insights.healthScore
source: Financial Health
ru: Финансовое здоровье

# insights.healthGrade.excellent
source: Excellent
ru: Отлично

# insights.healthGrade.good
source: Good
ru: Хорошо

# insights.healthGrade.fair
source: Fair
ru: Неплохо

# insights.healthGrade.needsAttention
source: Needs Attention
ru: Требует внимания

# insights.duplicateSubscriptions.title
source: Possible Duplicate Subscriptions
ru: Возможные дубликаты подписок

# insights.duplicateSubscriptions.subtitle
source: potential duplicates detected
ru: возможных дубликата

# insights.accountDormancy.title
source: Idle Account Detected
ru: Обнаружен неактивный счёт

# insights.accountDormancy.subtitle
source: accounts idle 30+ days
ru: счёта без активности 30+ дней

# insights.dormant.accounts
source: Idle Accounts
ru: Неактивные счета

# tab.home
source: Home
ru: Главная

# tab.analytics
source: Analytics
ru: Аналитика

# tab.settings
source: Settings
ru: Настройки

# tab.voice
source: Voice
ru: Голос

# tab.ocr
source: Import
ru: Импорт

# tab.add
source: Add
ru: Добавить

# tab.close
source: Close
ru: Закрыть
